var gongbaojiding = `
  <div class="details"><br><br>
    <h2>宫宝鸡丁</h2><br>
    <p class="txt_detail">
        宫保鸡丁，是一道闻名中外的特色传统名菜。鲁菜、川菜、贵州菜中都有收录，原料、做法有差别。
        [1]  该菜式的起源与鲁菜中的酱爆鸡丁，和贵州菜的胡辣子鸡丁有关，
        后被清朝山东巡抚、四川总督丁宝桢改良发扬，形成了一道新菜式——宫保鸡丁，并流传至今，
        此道菜也被归纳为北京宫廷菜[2]  。之后宫保鸡丁也流传到国外。<br><br>
        宫保鸡丁选用鸡肉为主料，佐以花生米、黄瓜、辣椒等辅料烹制而成。 红而不辣、
        辣而不猛、香辣味浓、肉质滑脆。由于其入口鲜辣，鸡肉的鲜嫩配合花生的香脆。
    </p>
    <h2>历史渊源</h2><br>
    <p class="txt_detail">
        <b>说法一</b><br><br>
        宫宝鸡丁由清朝山东巡抚、四川总督丁宝桢所创，他对烹饪颇有研究，喜欢吃鸡和花生米，
        并尤其喜好辣味。他在山东为官时曾命家厨改良鲁菜“酱爆鸡丁”为辣炒，后来在四川总督任
        上的时候将此菜推广开来，创制了一道将鸡丁、红辣椒、花生米下锅爆炒而成的美味佳肴。
        这道美味本来是丁家的私房菜，但后来尽人皆知，成为了人们熟知的宫保鸡丁。所谓“宫保”，
        其实是丁宝桢的荣誉官衔，丁宝桢治蜀十年，为官刚正不阿，多有建树，于光绪十一年死在任上，
        清廷为了表彰他的功绩，追赠“太子太保”。如上文所说，“太子太保”是“宫保”之一，
        于是，为了纪念丁宝桢，他发明的这道菜由此得名“宫保鸡丁”。由于这道菜流传太广，
        在各地有很多不同的做法，甚至还出现了将鸡丁演变为肉丁的“宫保肉丁”。宫保鸡丁传到西方后，
        西方人还根据自己的口味进行了一些改良，使之成为了符合西方口味的“西式宫保鸡丁”[5]  。<br><br>
        <b>说法二</b><br><br>
        一日，丁宝桢身着微服带一家仆去山东济南大明湖一带私访。天近中午，已觉腹饥，突然闻到一股子香
        味从附近一农家院中飘出，于是信步走进院中。只见一中年汉子正在灶房内炒菜。喜爱烹调的丁宫保连忙走上前
        问汉子炒的是何菜，汉子答道：“爆炒鸡丁”。汉子热情地让丁宝桢品尝一下，丁宝桢毫不客气地尝了一口，
        味道十分鲜美，连忙又问道：“既为鸡丁，为何却这般鲜嫩？”汉子答道：“此乃取当地笨鸡鸡脯肉切丁，
        而外薄裹淀粉糊（即是水淀粉），以利于快熟且可防味泄，再配以花生、胡椒，加上白糖、盐、酱油、南酒、
        葱、姜、蒜等调料，经旺火爆炒而成。成品色泽红亮，鸡丁细嫩，花生米酥脆，咸鲜香辣，佐酒下饭均宜。”
        丁宝桢抚须点头，找出盘中一花生入口里，细细咂摸，果真是别有滋味。
        这道菜令丁宝桢回味悠长，走时百般不舍，他记准了地方，回府不久就遣人重金把汉子聘为家厨。
        每每远客到，必用此道菜为压轴菜招待客人，百吃不厌世称美味。后来，
        丁宝桢奉调任四川总督，临行征求汉子意见，汉子感其恩重，遂携家眷一起随丁宝桢进川，
        进而把爆炒鸡丁带到了四川，他的后人通过把胡椒换成辣椒，做出了川味的宫保鸡丁。
        丁宝桢去世后不久，宫保鸡丁就被四川当地官员作为贡菜献给皇帝，发展成为御用的名菜之一[6]  。
    </p><br>
    <h2>风味特色</h2><br>
    <p class="txt_detail">
        宫保鸡丁的特色是辣中有甜，甜中有辣，鸡肉的鲜嫩配合花生的香脆，入口鲜辣酥香，红而不辣，辣而不猛，肉质滑脆。<br><br>
        宫保鸡丁入口之后，舌尖先感觉微麻、浅辣，而后冲击味蕾的是一股甜意，咀嚼时又会有些“许算算”的感觉，麻、辣、酸、甜包裹下的鸡丁、葱段、花生米使人欲罢不能。<br><br>
        各地的宫保鸡丁名字相同，做法却有不同：<br><br>
        川菜版的宫保鸡丁用的是鸡脯肉，由于鸡脯肉不容易入味，炒出来鸡肉容易嫩滑不足，需要在码味上浆之前，用刀背将鸡肉拍打几下，或者放入一只蛋白，这样的鸡肉会更加嫩滑。川菜版宫保鸡丁原料中必须使用油酥花生米和干辣椒节，味必须是辣型荔枝味。辣椒节炸香，突出糊辣味。<br><br>
        鲁菜版的宫保鸡丁更多采用鸡腿肉。为了更好地突出宫保鸡丁的口感，鲁菜还添加了笋丁或者马蹄丁。宫保鸡丁的做法和川菜做法大致相同，但是更注重急火爆炒，目的是保留鸡丁的鲜嫩。<br><br>
        贵州菜版的宫保鸡丁用的是糍粑辣椒，和川菜、鲁菜版本不一样。贵州版宫保鸡丁咸辣略带酸甜，请注意这个“酸”字，酸辣是贵州菜区别川菜的重要标志之一。[9]
    </p><br>
    <h2>营养价值</h2><br>
    <p class="txt_detail">
        宫保鸡丁富含蛋白质、钙、磷、铁、维生素及碳水化合物等营养成分，具有温中益气、滋补五脏、健脾胃、壮筋骨的功效。食之可养身滋补、增进食欲、促进人体健康、增强机体抵抗能力[10]  。
    </p>              
`;
////////////////////////////////////// 夫妻肺片///////////////////////////////////////////
var fuqifeipian = `
  <div class="details"><br><br>
    <h2>夫妻肺片</h2><br>
    <p class="txt_detail">
        夫妻肺片（英文名：Sliced Beef and Ox Tongue in Chilli Sauce）是一道四川成都名菜，由郭朝华、张田政夫妻创制而成。
通常以牛头皮、牛心、牛舌、牛肚、牛肉为主料，进行卤制，而后切片。再配以辣椒油、花椒面等辅料制成红油浇在上面。
夫妻肺片，制作精细，色泽美观，质嫩味鲜，麻辣浓香，非常适口。<br><br>
    </p>
    <h2>历史渊源</h2><br>
    <p class="txt_detail">
    相传，清朝末年，成都街头巷尾有许多挑担、提篮叫卖凉拌肺片的小贩。用成本低廉的牛杂碎边角料，经清洗、卤煮后切片，佐以酱油、红油、辣椒、花椒面、芝麻面等拌食，风味别致，价廉物美，特别受到拉黄包车、脚夫和穷苦学生们的喜食。<br><br>
    20世纪30年代，成都人郭朝华和妻子一道以制售凉拌肺片为业，他们夫妻俩亲自操作，走街串巷，提篮叫卖。由于选用牛肉铺的边角料做食材，价格便宜、味道好，颇受欢迎。人们就将这种凉拌牛杂称为“夫妻废片”。因为“废片”二字不好听，再加上食材中有牛肺片，便取‘废’的谐音‘肺’，改名为“夫妻肺片”。后来，他们发现牛肺的口感不好，便取消了牛肺。<br><br>
    1933年，郭氏夫妇在成都半边桥附近（今人民公园后门右侧）设店出售，店名正式取名为“夫妻肺片”，牌匾为金字黑底，由书法家赵蕴玉亲题。后几经变迁，该店迁至闹市街的提督西街，扩大了经营规模，增添了牛肉面等品种，食客不光是可以品尝肺片，还有面食充饥。<br><br>
    中华人民共和国成立后，在公私合营时期，郭氏夫妇的夫妻肺片店和其他传统的餐饮名店一样，并入国营单位。后经几代人努力，夫妻肺片已成为闻名中外的熟食外卖店品。<br><br>
    </p><br>
    <h2>风味特色</h2><br>
    <p class="txt_detail">
    夫妻肺片，色泽红亮，质地软嫩，口味麻辣浓香。观之青红碧绿，津河暗涌。一大青瓷盘新拌的肺片端上桌，红油重彩，颜色透亮；把箸入口中，便觉麻辣鲜香、软糯爽滑，脆筋柔糜、细嫩化渣。<br>
    </p><br>
    <h2>历史文化</h2><br>
    <p class="txt_detail">
    相传，在蜀国的安汉（今南充市）有一对夫妻，在嘉陵江畔开了一家小酒店。当时，在嘉陵江上有许多打鱼的渔民，还有不少过往的商船，人们在歇脚时，总喜欢来这家小酒店坐坐，顺便要些吃喝，因此这家小酒店的生意十分红火。<br><br>
    一日，驻守巴西郡的太守张飞路过此地，顺便来到这家小酒店吃饭，席间他对其中一道菜赞不绝口，并问这道菜的名字，老板说家常小菜，哪有什么名号。张飞见酒店上上下下全是夫妻二人打理，配合默契，菜的主料是牛肺，于是脱口而出，就叫夫妻肺片吧。张飞将此菜推荐给了大哥刘备，刘备甚为喜欢，并将夫妻肺片作为御膳供品。<br>
    </p>              
`;
//////////////////////////////////////鱼香肉丝///////////////////////////////////////////
var yuxiangrousi = `
  <div class="details"><br><br>
    <h2>鱼香肉丝</h2><br>
    <p class="txt_detail">
        鱼香肉丝（英文名：Stir-fried Pork Strips in Fish Sauce）是一道特色传统名菜，以鱼香调味而得名。相传灵感来自老菜泡椒肉丝，民国年间由四川籍厨师创制而成。<br><br>
        主料为猪肉、黑木耳，辅料因做法而各异，但多为胡萝卜、竹笋、辣椒等。猪肉选用三成肥、七成瘦的切丝滑炒，吃起来肉丝质地鲜嫩。<br><br>
        成菜色红润、肉嫩、质鲜、富鱼香味。其鱼香味并不来自鱼，而是由泡红辣椒、葱、姜、蒜、糖、盐、酱油等调味品调制而成。<br><br>
        “鱼香”与“余香”谐音，另一种说法是“余香肉丝”。余香系列的川菜，最主要的辅料是四川辣豆瓣酱。主料配以四川辣豆瓣酱加上其他调料烧出来的菜肴，其味厚重悠长，余味缭绕，回味无穷，故称余香。上世纪七十年代之前，餐馆菜单上书写的有“余香肉丝”菜名。<br><br>
    </p>
    <h2>历史渊源</h2><br>
    <p class="txt_detail">
        鱼香肉丝的历史不长。1909年出版的《成都通览》收录了1328种川味菜肴，没有鱼香味菜。<br><br>
        鱼香肉丝这道菜的名称，是抗战时期由蒋介石的厨师最终定名的，并流传至今。<br><br>
    </p><br>
    <h2>风味特色</h2><br>
    <p class="txt_detail">
        鱼香肉丝选料精细，成菜色泽红润、富鱼香味，吃起来具有咸甜酸辣兼备的特点，肉丝质地柔滑软嫩。<br><br>
    </p><br>
    <h2>历史文化</h2><br>
    <p class="txt_detail">
        相传很久以前，在四川有一户生意人家，他们家里的人很喜欢吃鱼，对调味也很讲究，所以他们在烧鱼的时候都
要放一些葱、姜、蒜、酒、醋、酱油、泡菜等去腥增味的调料。<br><br>
    有一天晚上，女主人在炒另一道菜的时候，为不浪费配料，就把上次烧鱼时的剩料放在这款菜中炒和。当时她还以为这款菜可能不好吃，不好向男人交待。她正在发呆之际，她的丈夫做生意回家了。不知是肚饥之故，还是感觉这款菜的特别，男人还没等开饭就用手抓起往嘴中咽，还迫不及待地问妻子此菜是用何做的。当她吞吞吐吐时，意外发现丈夫连连称赞其菜之味。她丈夫见她没回答，又问了一句“这么好吃是用什么做的”，此时妻子才一五一十地给他讲了一遍。<br><br>
    </p>              
`;