var data = [];
var dataStr = '1、川<br>\
<br>\
<h2 style="margin-left: 75px;">经典菜品</h2><b><br>\
·鱼香肉丝、宫保鸡丁<br>\
·水煮鱼、水煮肉片、夫妻肺片、辣子鸡丁<br>\
·麻婆豆腐、回锅肉、东坡肘子<br>\
·棒棒鸡、泡椒凤爪、灯影牛肉<br>\
·口水鸡<br>\
·酸辣土豆丝、香辣虾<br>\
·尖椒炒牛肉、四川火锅、麻辣香水鱼<br>\
·椒麻浸鲈鱼</b><br>\
<br>\
<br>\
2、徽<br>\
<br>\
<h2 style="margin-left: 75px;">经典菜品</h2><b><br>\
·火腿炖甲鱼，红烧果子狸、腌鲜鳜鱼、<黄山炖鸽></黄山炖鸽><br>\
·全家福、凤还巢、炒鳝糊、杨梅丸子<br>\
·沙地鲫鱼、银芽山鸡、红烧划水<br>\
·五色绣球、三虾豆腐<br>\
·红烧大烤、蜜汁火方<br>\
·雪映红梅、火煺烧边笋<br>\
·清蒸石鸡（即石蛙）、杨梅圆子</b><br>\
<br>\
<br>\
3、浙<br>\
<br>\
<h2 style="margin-left: 75px;">经典菜品</h2><b><br>\
·鲞扣鸡、鲞冻肉、虾油鸡、蓑衣虾球<br>\
·咸菜大汤黄鱼<br>\
·锅烧鳗<br>\
·三丝鱼卷、三片敲虾<br>\
·西湖醋鱼、东坡肉<br>\
·蛤蜊黄鱼羹、五芳斋粽子、雪菜大汤黄鱼<br>\
·西湖莼菜汤、油焖春笋</b><br>\
<br>\
4、湘<br>\
<br>\
<h2 style="margin-left: 75px;">经典菜品</h2><b><br>\
·剁椒鱼头、辣椒炒肉、湘西外婆菜<br>\
·吉首酸肉、牛肉粉<br>\
·郴州鱼粉，东安鸡<br>\
·金鱼戏莲、永州血鸭、腊味合蒸<br>\
·姊妹团子 、宁乡口味蛇、岳阳姜辣蛇<br>\
·网油叉烧洞庭桂鱼<br>\
·烟熏腊肉、子龙脱袍<br>\
·红烧牛蹄筋、花菇无黄蛋</b><br>\
<br>\
<br>\
5、粤<br>\
<br>\
<h2 style="margin-left: 75px;">经典菜品</h2><b><br>\
·白切鸡、烧鹅、烤乳猪、梅菜扣肉<br>\
·叉烧肉、老火靓汤、盐焗鸡<br>\
·白灼虾、广州文昌鸡、煲仔饭<br>\
·广式烧填鸭<br>\
·豉汁蒸排骨、鱼头豆腐汤<br>\
·菠萝咕噜肉、蚝油生菜、香煎芙蓉蛋<br>\
·清蒸石斑鱼<br>\
·鼎湖上素、烟筒白菜</b><br>\
<br>\
<br>\
6、苏<br>\
<br>\
<h2 style="margin-left: 75px;">经典菜品</h2><b><br>\
·烤方<br>\
·水晶肴蹄<br>\
·三套鸭<br>\
·黄泥煨鸡、清炖鸡孚、盐水鸭<br>\
·陆稿荐酱猪头肉<br>\
·鸡汤煮干丝<br>\
·凤尾虾、三套鸭、无锡肉骨头</b><br>\
<br>\
<br>\
7、闽<br>\
<br>\
<h2 style="margin-left: 75px;">经典菜品</h2><b><br>\
·厦门沙茶面、荔枝肉、白雪鸡<br>\
·福州鱼丸、鼎边糊、<br>\
·漳州卤面、莆田卤面、海蛎煎、<br>\
·醋椒鱼、糟熘鱼片<br>\
·乌柳居（五柳居）<br>\
·面线糊、闽南咸饭、兴化米粉、<br>\
·闽生果、醉排骨、红糟鱼排、<br>\
·长汀豆腐干</b><br>\
<br>\
8、鲁<br>\
<br>\
<h2 style="margin-left: 75px;">经典菜品</h2><b><br>\
·一品豆腐、葱烧海参、三丝鱼翅<br>\
·白扒四宝、糖醋黄河鲤鱼<br>\
·油爆双脆、扒原壳鲍鱼、油焖大虾<br>\
·醋椒鱼、糟熘鱼片<br>\
·温炝鳜鱼片、芫爆鱿鱼卷<br>\
·木樨肉（木须肉）、胶东四大温拌<br>\
·糖醋里脊、红烧大虾、招远蒸丸、清蒸加吉鱼、葱椒鱼<br>\
·糖酱鸡块、油泼豆莛</b><br>\
';
var d = dataStr.split('<br><br><br>');
for (var i = 0; i < d.length; i++) {
    var c = d[i].split('<br><br>');
    data.push({
        img: c[0].replace('、', ' ') + '.jpg',
        caption: c[0].split('、')[1],
        desc: c[1]
    });
};